In [1]:
%load_ext sql

# put a folder and DB credential files at HOME directory

import os
homedir = os.getcwd()
cred_path = os.path.join(homedir, 'db_cred')



# add a 'cred_path' for interpreter to search
import sys
sys.path.append(cred_path)



# import DB credentials from 'gpdb_credentials.py' dictionary file.
from gpdb_credentials import dvdrental_db



# parsing DB credentials and connect to Greenplum using %sql $connection_string

username = dvdrental_db['Username']
password = dvdrental_db['Password']
host = dvdrental_db['Host']
port = dvdrental_db['Port']
database = dvdrental_db['Database']

connection_string = 'postgresql://{user}:{password}@{host}:{port}/{db}'.format(
user=username,
password=password,
host=host,
port=port,
db=database)

%sql $connection_string

'Connected: myuser@dvdrental'

# 문제 리스트

>문제1번 
고객의 기본 정보인, 고객 id, 이름, 성, 이메일과 함께 고객의 주소 address, district, postal_code, phone 번호를 함께 출력하시오. 	

>문제2번
고객의  기본 정보인, 고객 id, 이름, 성, 이메일과 함께 고객의 주소 address, district, postal_code, phone , city 를 함께 출력하시오. 	

>문제3번
Lima City에 사는 고객의 이름과, 성, 이메일, phonenumber에 대해서 출력하시오.	

>문제4번
rental 정보에 추가로, 고객의 이름과, 직원의 이름을 함께 출력하시오.
(고객의 이름, 직원 이름은 이름과 성을  fullname 컬럼으로만들어서 직원이름/고객이름 2개의 컬럼으로 출력하시오.)	

>문제5번 seth.hannon@sakilacustomer.org 이메일 주소를 가진 고객의  주소 address, address2, postal_code, phone, city 주소를 출력하시오.	

>문제6번 Jon Stephens 직원을 통해 dvd대여를 한 payment 기록 정보를  확인하려고 합니다. 
(payment_id,  고객 이름 과 성,  rental_id, amount, staff 이름과 성을 출력하시오.) 	

>문제7번 배우가 출연하지 않는 영화의 film_id, title, release_year, rental_rate, length 를 출력하시오. 	

>문제8번 store 상점 id별 주소 (address, address2, distict) 와 해당 상점이 위치한 city 주소를 출력하시오. 	

>문제9번 고객의 id 별로 고객의 이름 (first_name, last_name), 이메일, 고객의 주소 (address, district), phone번호, city, country 를 출력하시오. 	

>문제10번 country 가 china 가 아닌 지역에 사는, 고객의 이름(first_name, last_name)과 , email, phonenumber, country, city 를 출력하시오	

>문제11번 Horror 카테고리 장르에 해당하는 영화의 이름과 description 에 대해서 출력하시오 	

>문제12번 Music 장르이면서, 영화길이가 60~180분 사이에 해당하는 영화의 title, description, length 를 출력하시오.
(영화 길이가 짧은 순으로 정렬해서 출력하시오.)
 
>문제13번 actor 테이블을 이용하여,  배우의 ID, 이름, 성 컬럼에 추가로    'Angels Life' 영화에 나온 영화 배우 여부를 Y , N 으로 컬럼을 추가 표기해주세요.  해당 컬럼은 angelslife_flag로 만들어주세요.	         

>문제14번 대여일자가 2005-06-01~ 14일에 해당하는 주문 중에서 , 직원의 이름(이름 성) = 'Mike Hillyer' 이거나  고객의 이름이 (이름 성) ='Gloria Cook'  에 해당 하는 rental 의 모든 정보를 출력하시오.
(추가로  직원이름과, 고객이름에 대해서도  fullname 으로 구성해서 출력하시오.)

>문제15번 대여일자가 2005-06-01~ 14일에 해당하는 주문 중에서 , 직원의 이름(이름 성) = 'Mike Hillyer' 에 해당 하는 직원에게  구매하지 않은  rental 의 모든 정보를 출력하시오.
(추가로  직원이름과, 고객이름에 대해서도  fullname 으로 구성해서 출력하시오.)

# 문제 1
>문제1번 
고객의 기본 정보인, 고객 id, 이름, 성, 이메일과 함께 고객의 주소 address, district, postal_code, phone 번호를 함께 출력하시오. 

- 고객 id, 이름, 성, 이메일 에 대한 데이터는 CUSTOMER 테이블에 있다.
- 고객의 주소 address, district, postal_code, phone 번호 에 대한 정보는 ADDRESS 테이블에 있다.
- 두 테이블에 공통으로 존재하는 컬럼은 ADDRESS_ID 컬럼이다.

INNER JOIN으로 풀기(1)

In [9]:
%%sql

SELECT
    A.CUSTOMER_ID, A.LAST_NAME||' '||A.FIRST_NAME AS FULL_NAME,
    A.EMAIL, B.ADDRESS,
    B.DISTRICT, B.POSTAL_CODE,
    B.PHONE
FROM CUSTOMER A
INNER JOIN 
    ADDRESS B
ON (A.ADDRESS_ID = B.ADDRESS_ID) -- 두 테이블 사이의 공통 컬럼
LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(1, 'Smith Mary', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', 'Nagasaki', '35200', '28303384290'),
 (2, 'Johnson Patricia', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', 'California', '17886', '838635286649'),
 (3, 'Williams Linda', 'linda.williams@sakilacustomer.org', '692 Joliet Street', 'Attika', '83579', '448477190408'),
 (4, 'Jones Barbara', 'barbara.jones@sakilacustomer.org', '1566 Inegl Manor', 'Mandalay', '53561', '705814003527'),
 (5, 'Brown Elizabeth', 'elizabeth.brown@sakilacustomer.org', '53 Idfu Parkway', 'Nantou', '42399', '10655648674')]

INNER JOIN으로 풀기(2)
 - INNER JOIN은 JOIN 만 입력했을 경우에도 적용된다.

In [13]:
%%sql

SELECT
    A.CUSTOMER_ID, A.LAST_NAME||' '||A.FIRST_NAME AS FULL_NAME,
    A.EMAIL, B.ADDRESS,
    B.DISTRICT, B.POSTAL_CODE,
    B.PHONE
FROM CUSTOMER A 
JOIN 
    ADDRESS B
ON (A.ADDRESS_ID = B.ADDRESS_ID) -- 두 테이블 사이의 공통 컬럼
LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(1, 'Smith Mary', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', 'Nagasaki', '35200', '28303384290'),
 (2, 'Johnson Patricia', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', 'California', '17886', '838635286649'),
 (3, 'Williams Linda', 'linda.williams@sakilacustomer.org', '692 Joliet Street', 'Attika', '83579', '448477190408'),
 (4, 'Jones Barbara', 'barbara.jones@sakilacustomer.org', '1566 Inegl Manor', 'Mandalay', '53561', '705814003527'),
 (5, 'Brown Elizabeth', 'elizabeth.brown@sakilacustomer.org', '53 Idfu Parkway', 'Nantou', '42399', '10655648674')]

WHERE 절에 조건 부여해서 풀기

In [12]:
%%sql

SELECT
    A.CUSTOMER_ID, A.LAST_NAME||' '||A.FIRST_NAME AS FULL_NAME,
    A.EMAIL, B.ADDRESS,
    B.DISTRICT, B.POSTAL_CODE,
    B.PHONE
FROM CUSTOMER A, ADDRESS B
WHERE A.ADDRESS_ID = B.ADDRESS_ID -- 두 테이블 사이의 공통 컬럼
LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(1, 'Smith Mary', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', 'Nagasaki', '35200', '28303384290'),
 (2, 'Johnson Patricia', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', 'California', '17886', '838635286649'),
 (3, 'Williams Linda', 'linda.williams@sakilacustomer.org', '692 Joliet Street', 'Attika', '83579', '448477190408'),
 (4, 'Jones Barbara', 'barbara.jones@sakilacustomer.org', '1566 Inegl Manor', 'Mandalay', '53561', '705814003527'),
 (5, 'Brown Elizabeth', 'elizabeth.brown@sakilacustomer.org', '53 Idfu Parkway', 'Nantou', '42399', '10655648674')]

# 문제 2.	
>문제2번
고객의  기본 정보인, 고객 id, 이름, 성, 이메일과 함께 고객의 주소 address, district, postal_code, phone , city 를 함께 출력하시오. 	

- 고객 id, 이름, 성, 이메일 에 대한 데이터는 CUSTOMER 테이블에 있다.
- 고객의 주소 address, district, postal_code, phone 번호 에 대한 정보는 ADDRESS 테이블에 있다.
- city 에 대한 정보는 CITY 테이블에 있다.
- CUSTOMER 테이블과 ADDRESS 테이블에 공통으로 존재하는 컬럼은 ADDRESS_ID 컬럼이다.
- ADDRESS 테이블과 CITY 테이블에 공통으로 존재하는 컬럼은 CITY_ID 이다.

INNER JOIN으로 풀기

In [22]:
%%sql

SELECT
    A.CUSTOMER_ID, A.LAST_NAME||' '||A.FIRST_NAME AS FULL_NAME,
    A.EMAIL, B.ADDRESS,
    B.DISTRICT, B.POSTAL_CODE,
    B.PHONE, C.CITY
FROM 
        CUSTOMER A
INNER JOIN 
        ADDRESS B ON (A.ADDRESS_ID = B.ADDRESS_ID)
INNER JOIN
        CITY C ON (B.CITY_ID = C.CITY_ID)
LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(1, 'Smith Mary', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', 'Nagasaki', '35200', '28303384290', 'Sasebo'),
 (2, 'Johnson Patricia', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', 'California', '17886', '838635286649', 'San Bernardino'),
 (3, 'Williams Linda', 'linda.williams@sakilacustomer.org', '692 Joliet Street', 'Attika', '83579', '448477190408', 'Athenai'),
 (4, 'Jones Barbara', 'barbara.jones@sakilacustomer.org', '1566 Inegl Manor', 'Mandalay', '53561', '705814003527', 'Myingyan'),
 (5, 'Brown Elizabeth', 'elizabeth.brown@sakilacustomer.org', '53 Idfu Parkway', 'Nantou', '42399', '10655648674', 'Nantou')]

WHERE 절에 조건 부여해서 풀기

In [18]:
%%sql

SELECT
    A.CUSTOMER_ID, A.LAST_NAME||' '||A.FIRST_NAME AS FULL_NAME,
    A.EMAIL, B.ADDRESS,
    B.DISTRICT, B.POSTAL_CODE,
    B.PHONE, C.CITY
FROM CUSTOMER A, ADDRESS B, CITY C
WHERE A.ADDRESS_ID = B.ADDRESS_ID
AND
    B.CITY_ID = C.CITY_ID
    LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(1, 'Smith Mary', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', 'Nagasaki', '35200', '28303384290', 'Sasebo'),
 (2, 'Johnson Patricia', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', 'California', '17886', '838635286649', 'San Bernardino'),
 (3, 'Williams Linda', 'linda.williams@sakilacustomer.org', '692 Joliet Street', 'Attika', '83579', '448477190408', 'Athenai'),
 (4, 'Jones Barbara', 'barbara.jones@sakilacustomer.org', '1566 Inegl Manor', 'Mandalay', '53561', '705814003527', 'Myingyan'),
 (5, 'Brown Elizabeth', 'elizabeth.brown@sakilacustomer.org', '53 Idfu Parkway', 'Nantou', '42399', '10655648674', 'Nantou')]

# 문제 3.
>문제3번
Lima City에 사는 고객의 이름과, 성, 이메일, phonenumber에 대해서 출력하시오.

INNER JOIN 으로 풀기

- where 절은 항상 from절 뒤에 온다.
    - inner절은 항상 from절 뒤에 온다.
    - from절과 inner절은 데이터를 불러오는 하나의 절이라 인식하는 것이 좋다.
- where 절에 '='을 쓰지 않은 이유:
    - 혹시라도 Lima가 아닌 여러 CITY 컬럼의 값을 동시에 검색하고자 할때 (즉, 코드가 추가되거나 city 조건이 추가될때 수정이 용이) 관리하기 유용하기 때문

In [2]:
%%sql

SELECT 
	A.CUSTOMER_ID,
	A.LAST_NAME || ' ' || A.FIRST_NAME as NAME,
	A.EMAIL,
	B.PHONE,
	C.CITY
FROM
	CUSTOMER A
JOIN ADDRESS B
ON
	A.ADDRESS_ID = B.ADDRESS_ID
JOIN CITY C
ON
	B.CITY_ID = C.CITY_ID
	WHERE
	C.CITY in ('Lima');

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
1 rows affected.

[(122, 'Murray Thelma', 'thelma.murray@sakilacustomer.org', '937222955822', 'Lima')]

3-1 )Lima City와 Bhopal 에 사는 고객의 이름과, 성, 이메일, phonenumber에 대해서 출력하시오.

In [4]:
%%sql

SELECT 
	A.CUSTOMER_ID,
	A.LAST_NAME || ' ' || A.FIRST_NAME as NAME,
	A.EMAIL,
	B.PHONE,
	C.CITY
FROM
	CUSTOMER A
JOIN ADDRESS B
ON
	A.ADDRESS_ID = B.ADDRESS_ID
JOIN CITY C
ON
	B.CITY_ID = C.CITY_ID
	WHERE
	C.CITY in ('Lima','Bhopal', 'New Yokr');

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
2 rows affected.

[(15, 'Harris Helen', 'helen.harris@sakilacustomer.org', '990911107354', 'Bhopal'),
 (122, 'Murray Thelma', 'thelma.murray@sakilacustomer.org', '937222955822', 'Lima')]

3-2) 데이터 셋에 New York 이란 도시가 없는 것인지 확인하시오.

In [5]:
%%sql

SELECT
	*
FROM
	CITY
WHERE
	CITY LIKE 'New%';

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
1 rows affected.

[(364, 'Newcastle', 85, datetime.datetime(2006, 2, 15, 9, 45, 25))]

위의 3-1 에서 결과 값이 2개인 이유는 New York이 데이터에 없기 때문이다.

# 문제 4.
>문제4번
rental 정보에 추가로, 고객의 이름과, 직원의 이름을 함께 출력하시오.
(고객의 이름, 직원 이름은 이름과 성을  fullname 컬럼으로만들어서 직원이름/고객이름 2개의 컬럼으로 출력하시오.)

- rental 에 고객에 대한 정보는 customer_id 뿐이다.
- 고객 명이 있는 테이블은 customer, 직원명이 있는 테이블은 staff 이다.
- full name을 만드는 것은 '|| ||' 을 활용한다.

In [7]:
%%sql

SELECT
	R.* , -- RENTAL 테이블의 모든 컬럼 출력
	C.LAST_NAME || ' ' || C.FIRST_NAME AS CUSTOMER_NAME, -- 고객명
	S.LAST_NAME || ' ' || S.FIRST_NAME AS STAFF_NAME -- 직원명
FROM
	RENTAL R
JOIN CUSTOMER C 	
ON
	R.CUSTOMER_ID = C.CUSTOMER_ID
JOIN STAFF S 
ON
	R.STAFF_ID = S.STAFF_ID
LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(2, datetime.datetime(2005, 5, 24, 22, 54, 33), 1525, 459, datetime.datetime(2005, 5, 28, 19, 40, 33), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Collazo Tommy', 'Hillyer Mike'),
 (3, datetime.datetime(2005, 5, 24, 23, 3, 39), 1711, 408, datetime.datetime(2005, 6, 1, 22, 12, 39), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Murrell Manuel', 'Hillyer Mike'),
 (4, datetime.datetime(2005, 5, 24, 23, 4, 41), 2452, 333, datetime.datetime(2005, 6, 3, 1, 43, 41), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Purdy Andrew', 'Stephens Jon'),
 (5, datetime.datetime(2005, 5, 24, 23, 5, 21), 2079, 222, datetime.datetime(2005, 6, 2, 4, 33, 21), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Hansen Delores', 'Hillyer Mike'),
 (6, datetime.datetime(2005, 5, 24, 23, 8, 7), 2792, 549, datetime.datetime(2005, 5, 27, 1, 32, 7), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Christenson Nelson', 'Hillyer Mike')]

# 문제 5.
>문제5번 seth.hannon@sakilacustomer.org 이메일 주소를 가진 고객의  주소 address, address2, postal_code, phone, city 주소를 출력하시오.	

- 고객 이메일주소는 customer 테이블에 있다.
- address, address2, postal_code, phone 는 address 테이블에 있다.
- city 는 city 테이블에 있다.

In [9]:
%%sql

SELECT
	C.EMAIL,
	A.ADDRESS,
	A.ADDRESS2,
	A.POSTAL_CODE,
	A.PHONE,
	CT.CITY
FROM
	CUSTOMER C
JOIN ADDRESS A
ON
	C.ADDRESS_ID = A.ADDRESS_ID
JOIN CITY CT
ON
	A.CITY_ID = CT.CITY_ID
WHERE
	C.EMAIL = 'seth.hannon@sakilacustomer.org';

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
1 rows affected.

[('seth.hannon@sakilacustomer.org', '1759 Niznekamsk Avenue', '', '39414', '864392582257', 'al-Manama')]

# 문제 6.
>문제6번 Jon Stephens 직원을 통해 dvd대여를 한 payment 기록 정보를  확인하려고 합니다. 
(payment_id,  고객 이름 과 성,  rental_id, amount, staff 이름과 성을 출력하시오.) 	

- 직원 이름은 staff 테이블에 있다.
- payment_id, rental_id, amount는 payment 테이블에 있다.
- 고객 이름은 customer 테이블에 있다.
- customer 테이블은 customer_id로 payment와 join할 수 있다.
- pyament 테이블은 staff_id로 staff 와 join 할 수 있다.

In [21]:
%%sql


SELECT 
	P.PAYMENT_ID,
	P.RENTAL_ID,
	P.AMOUNT,
	C.FIRST_NAME ||' '|| C.LAST_NAME AS CUSTOMER_NAME,
	S.FIRST_NAME ||' '|| S.LAST_NAME AS STAFF_NAME
FROM
	PAYMENT P
JOIN CUSTOMER C 
ON
	P.CUSTOMER_ID = C.CUSTOMER_ID
JOIN STAFF S 
ON
	P.STAFF_ID = S.STAFF_ID
WHERE
		S.FIRST_NAME ||' '|| S.LAST_NAME = 'Jon Stephens'
LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(18203, 1651, Decimal('4.99'), 'Jared Ely', 'Jon Stephens'),
 (18204, 3454, Decimal('2.99'), 'Jared Ely', 'Jon Stephens'),
 (21950, 13626, Decimal('2.99'), 'Jared Ely', 'Jon Stephens'),
 (21951, 14046, Decimal('4.99'), 'Jared Ely', 'Jon Stephens'),
 (21954, 14680, Decimal('1.99'), 'Jared Ely', 'Jon Stephens')]

# 문제 7.
>문제7번 배우가 출연하지 않는 영화의 film_id, title, release_year, rental_rate, length 를 출력하시오. 	

- film_id, title, release_year, rental_rate, length 는 film테이블에 있다.
- 배우에 대한 정보는 actor 테이블에 있다.
- actor와 film 테이블은 last_update 컬럼외에 공통 컬럼이 없다.
    - last_update 컬럼은 timestamp 형식이라 두 컬럼간 inner join이 가능한 컬럼이 있을 가능성은 매우 낮다.
- film과 actor의 정보를 모두 가진 film_actor 테이블을 통해 join이 가능하다.
- film_actor와 film 사이의 left outer join 한 테이블과 / actor와 film_actor 사이를 left outer join한 테이블을 각각 연결하면 된다.
- '배우가 출현하지 않은 영화' = join한 테이블에서 actor_id 값이 null인 집합 찾기

In [22]:
%%sql

SELECT 
	F.FILM_ID,
	F.TITLE,
	F.RELEASE_YEAR,
	F.RENTAL_RATE,
	F.LENGTH
FROM
	FILM F
LEFT OUTER JOIN FILM_ACTOR FA ON
	F.FILM_ID = FA.FILM_ID
LEFT OUTER JOIN ACTOR A ON
	A.ACTOR_ID = FA.ACTOR_ID
WHERE
	A.ACTOR_ID IS NULL;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
3 rows affected.

[(803, 'Slacker Liaisons', 2006, Decimal('4.99'), 179),
 (323, 'Flight Lies', 2006, Decimal('4.99'), 179),
 (257, 'Drumline Cyclone', 2006, Decimal('0.99'), 110)]

# 문제 8.
>문제8번 store 상점 id별 주소 (address, address2, district) 와 해당 상점이 위치한 city 주소를 출력하시오. 	

- 상점 id별 주소 (address, address2, distict) 는 store 테이블
- store 테이블과 city 테이블은 address테이블로 연결 가능.
- address는
    - address_id로 store 테이블과 연결가능
    - city_id로 city 테이블과 연결 가능

In [23]:
%%sql

SELECT 
	S.STORE_ID,
	A.ADDRESS,
	A.ADDRESS2,
	A.DISTRICT,
	C.CITY
FROM
	STORE S
LEFT OUTER JOIN ADDRESS A ON
	S.ADDRESS_ID = A.ADDRESS_ID
LEFT OUTER JOIN CITY C ON
	C.CITY_ID = A.CITY_ID;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
2 rows affected.

[(1, '47 MySakila Drive', None, 'Alberta', 'Lethbridge'),
 (2, '28 MySQL Boulevard', None, 'QLD', 'Woodridge')]

# 문제 9. 
>문제9번 고객의 id 별로 고객의 이름 (first_name, last_name), 이메일, 고객의 주소 (address, district), phone번호, city, country 를 출력하시오. 	

- customer 테이블에 customer_id, first_name, last_name, email
- address 테이블에 address, district, phone
- city 테이블에 city
- country 테이블에 country

- address는
    - city 테이블과 cidy_id로 join할 수 있다.
    - customer 테이블과 address_id로 join할 수 있다.

In [25]:
%%sql

SELECT 
	C.CUSTOMER_ID,
	C.FIRST_NAME || ' ' || C.LAST_NAME AS CUSTOMER_NAME,
	C.EMAIL,
	A.ADDRESS,
	A.DISTRICT,
	A.PHONE,
	CT.CITY,
	CTY.COUNTRY
FROM
	CUSTOMER C
JOIN ADDRESS A ON
	C.ADDRESS_ID = A.ADDRESS_ID
JOIN CITY CT ON
	A.CITY_ID = CT.CITY_ID
JOIN COUNTRY CTY ON
	CT.COUNTRY_ID = CTY.COUNTRY_ID
LIMIT 10;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
10 rows affected.

[(1, 'Mary Smith', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', 'Nagasaki', '28303384290', 'Sasebo', 'Japan'),
 (2, 'Patricia Johnson', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', 'California', '838635286649', 'San Bernardino', 'United States'),
 (3, 'Linda Williams', 'linda.williams@sakilacustomer.org', '692 Joliet Street', 'Attika', '448477190408', 'Athenai', 'Greece'),
 (4, 'Barbara Jones', 'barbara.jones@sakilacustomer.org', '1566 Inegl Manor', 'Mandalay', '705814003527', 'Myingyan', 'Myanmar'),
 (5, 'Elizabeth Brown', 'elizabeth.brown@sakilacustomer.org', '53 Idfu Parkway', 'Nantou', '10655648674', 'Nantou', 'Taiwan'),
 (6, 'Jennifer Davis', 'jennifer.davis@sakilacustomer.org', '1795 Santiago de Compostela Way', 'Texas', '860452626434', 'Laredo', 'United States'),
 (7, 'Maria Miller', 'maria.miller@sakilacustomer.org', '900 Santiago de Compostela Parkway', 'Central Serbia', '716571220373', 'Kragujevac', 'Yugoslavia'),
 (8, 'Susan Wilson', 'susan.wilson@sakilacustomer.org', '478 Joliet Way', 'Hamilton', '657282285970', 'Hamilton', 'New Zealand'),
 (9, 'Margaret Moore', 'margaret.moore@sakilacustomer.org', '613 Korolev Drive', 'Masqat', '380657522649', 'Masqat', 'Oman'),
 (10, 'Dorothy Taylor', 'dorothy.taylor@sakilacustomer.org', '1531 Sal Drive', 'Esfahan', '648856936185', 'Esfahan', 'Iran')]

# 문제 10.
>문제10번 country 가 china 가 아닌 지역에 사는, 고객의 이름(first_name, last_name)과 , email, phonenumber, country, city 를 출력하시오.

- country는 country 테이블에 있다.
- 고객명, email은 customer 테이블에 있다.
- phonenumber(=phone)은 address 테이블에 있다.
- city는 city 테이블에 있다.

- 총 4개의 테이블을 join해야 한다.
- customer은 address_id로 address와 join할 수 있다.
- city는 address와 city_id로 join할 수 있다.
- country는 city와 country_id로 join할 수 있다.

In [26]:
%%sql

SELECT
	C.FIRST_NAME || ' ' || C.LAST_NAME AS CUSTOMER_NAME,
	C.EMAIL,
	A.PHONE,
	CTY.COUNTRY,
	CT.CITY
FROM
	CUSTOMER C
JOIN ADDRESS A ON
	C.ADDRESS_ID = A.ADDRESS_ID
JOIN CITY CT ON
	CT.CITY_ID = A.CITY_ID
JOIN COUNTRY CTY ON
	CTY.COUNTRY_ID = CT.COUNTRY_ID
WHERE
	CTY.COUNTRY NOT IN ('CHINA')
LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[('Mary Smith', 'mary.smith@sakilacustomer.org', '28303384290', 'Japan', 'Sasebo'),
 ('Patricia Johnson', 'patricia.johnson@sakilacustomer.org', '838635286649', 'United States', 'San Bernardino'),
 ('Linda Williams', 'linda.williams@sakilacustomer.org', '448477190408', 'Greece', 'Athenai'),
 ('Barbara Jones', 'barbara.jones@sakilacustomer.org', '705814003527', 'Myanmar', 'Myingyan'),
 ('Elizabeth Brown', 'elizabeth.brown@sakilacustomer.org', '10655648674', 'Taiwan', 'Nantou')]

>문제11번 Horror 카테고리 장르에 해당하는 영화의 이름과 description 에 대해서 출력하시오 	

>문제12번 Music 장르이면서, 영화길이가 60~180분 사이에 해당하는 영화의 title, description, length 를 출력하시오.
(영화 길이가 짧은 순으로 정렬해서 출력하시오.)
 
>문제13번 actor 테이블을 이용하여,  배우의 ID, 이름, 성 컬럼에 추가로    'Angels Life' 영화에 나온 영화 배우 여부를 Y , N 으로 컬럼을 추가 표기해주세요.  해당 컬럼은 angelslife_flag로 만들어주세요.	         

>문제14번 대여일자가 2005-06-01~ 14일에 해당하는 주문 중에서 , 직원의 이름(이름 성) = 'Mike Hillyer' 이거나  고객의 이름이 (이름 성) ='Gloria Cook'  에 해당 하는 rental 의 모든 정보를 출력하시오.
(추가로  직원이름과, 고객이름에 대해서도  fullname 으로 구성해서 출력하시오.)

>문제15번 대여일자가 2005-06-01~ 14일에 해당하는 주문 중에서 , 직원의 이름(이름 성) = 'Mike Hillyer' 에 해당 하는 직원에게  구매하지 않은  rental 의 모든 정보를 출력하시오.
(추가로  직원이름과, 고객이름에 대해서도  fullname 으로 구성해서 출력하시오.)